<HTML>
<HEAD>
  <META HTTP-EQUIV="Content-Type" CONTENT="text/html; charset=ISO-8859-1">
  <META NAME="GENERATOR" CONTENT="Internet Assistant for Microsoft Word 2.04z">
  <TITLE>Gridbag Layout</TITLE>
</HEAD>
<BODY BGCOLOR="#ffffff">
<H1>
  <A NAME="Start"><IMG SRC="java-logo.gif" WIDTH="120" HEIGHT="110" ALIGN="Middle"
      ALT="TassKaff"></A>Das Gridbag Layout
</H1>
<P>
  <HR>
<P>
Die Designsprache GDL bedient sich des sogenannten Gridbag-Layouts, in dem
die grafischen Elemente eines Bildschirmdialogs in ihren Beziehungen zueinander,
aber nicht deren absolute Positionen festgelegt werden. Auf dieses Weise
findet sich die exakte Positionierung abh&auml;ngig von der
Fenstergr&ouml;&szlig;e zur Laufzeit von selbst. Dies unterst&uuml;tzt nicht
nur die Anwendungsergonomie, sondern erspart dem Designer auch das pixelweise
Justieren der Dialogelemente.
<P>
Das Gridbag Layout versetzt uns am ehesten in die Lage,&nbsp;eine gro&szlig;e
Zahl komplexer Layouts, die flexibel eingesetzt werden k&ouml;nnen, zu
bew&auml;ltigen. Andererseits ist es nicht einfach zu handhaben, wenn wir
versuchen, komplexe Layouts direkt in Java zu codieren. Ein GuiBuilder, der
GridBagLayout verwendet, schenkt uns die Vorteile des Gridbag Layouts und
erspart uns gleichzeitig die M&uuml;he der Codierung.
<P>
Wir k&ouml;nnen den GuiBuilder aber nur dann optimal verwenden, wenn wir
die Grundz&uuml;ge des GridBagLayouts verstanden haben. Darauf wollen wir
uns jetzt kurz konzentrieren.
<P>
Das Gridbag Layout ordnet Objekte dynamisch in einem rechteckigen Gitter
an. Die Zellen dieses Gitters brauchen nicht gleich gro&szlig; zu sein, und
die Objekte k&ouml;nnen mehrere Zellen belegen. Die Ausdehnung und Lage einer
Zelle, die Position eines Objektes innerhalb seiner Zelle und die Art und
Weise, wie ein Objekt den Raum in seiner Zelle ausf&uuml;llt, ist nicht nur
abh&auml;ngig von den Eigenschaften des Objektes selber, sondern auch von
den Eigenschaften seiner Nachbarobjekte und dem Gr&ouml;&szlig;enzustand
des gesamten Layouts.
<P>
Das war die kurze und grobe Erkl&auml;rung (schwer zu verstehen). Lies die
<B><A HREF="Die10PrinzipienDesGridbagLayouts.html">10 Prinzipien des
Gridbag-Layouts</A></B> (leicht zu verstehen), um das Gridbag Layout im Detail
zu durchschauen.
<P>
<A NAME="gridbag"><!-- --></A>Wer die&nbsp;10 Prinzipien verstanden hat
wei&szlig; genug &uuml;ber das Gridbag Layout, um meine Designsprache GDL
zu verstehen und damit auch genug, um den GuiBuilder zu verwenden, der gebaut
ist - wie bereits erw&auml;hnt - um Skripte der Designsprache GDL zu
interpretieren.
<P>
Hier ist eine kurze
<A HREF="http://java.sun.com/docs/books/tutorial/uiswing/layout/using.html">Einf&uuml;hrung</A>
(website) zum Thema Layout Manager in Java. Wer sich das Gridbag Layout im
Kontext einiger Beispiele etwas detaillierter anschauen will, ist mit dieser
<A HREF="http://pandonia.canberra.edu.au/java/xadvisor/gridbag/gridbag.html">detaillierteren
Diskussion</A> (website) als Erg&auml;nzung gut bedient.
<P>
<A HREF="GridbagLayout.html#Start" TARGET="_self">Seitenanfang</A>
<P>
<A HREF="GDL_Defi.html#Start" TARGET="_self">home</A>
</BODY></HTML>
