<HTML>
<HEAD>
  <META HTTP-EQUIV="Content-Type" CONTENT="text/html; charset=ISO-8859-1">
  <META NAME="GENERATOR" CONTENT="Internet Assistant for Microsoft Word 2.04z">
  <TITLE>GDL - Spezifikation</TITLE>
</HEAD>
<BODY BGCOLOR="#ffffff">
<H1>
  <A NAME="Start"><IMG SRC="java-logo.gif" WIDTH="120" HEIGHT="110" ALIGN="Middle"
      ALT="TassKaff"></A>GUI Design Language (GDL)
</H1>
<P>
  <HR>
<P>
Es gibt standardisierte Beschreibungssprachen f&uuml;r die Definition von
Datenbanken (DDL), Objektmodellen (UML) und CORBA-Schnittstellen (IDL).
<P>
Eine Beschreibungssprache f&uuml;r die grafische Bedienschnittstelle (Graphical
User Interface = GUI) gibt es - als allseits anerkannten Standard - leider
nicht.
<P>
Dies ist bedauerlich, denn auf der Basis einer solchen Beschreibungssprache
lassen sich nicht nur Oberfl&auml;chenklassen generieren. Das leisten
herk&ouml;mmliche GUI-Tools - mit anderen Mitteln - bereits seit vielen Jahren.
Eine Beschreibungssprache er&ouml;ffnet uns ganz andere M&ouml;glichkeiten:
<P>
Oberfl&auml;chenspezifikationen, die in einer solchen Sprache formuliert
sind, sind <I>interpretierbar</I>, d.h. sie sind ablauff&auml;hige Prototypen.
Mit solchen Prototypen k&ouml;nnen wir in der Spezifikationsphase eines
Softwareprojektes sehr anschaulich arbeiten. Solche Spezifikationen lassen
sich aber&nbsp;auch elegant in die Laufzeitumgebung eines Zielsystems integrieren
und verringern, weil sie nicht kompiliert werden m&uuml;ssen, den Anpassungs-
und Wartungsaufwand in der Phase vor und nach der Inbetriebnahme erheblich.
<P>
Ich m&ouml;chte hier eine solche Sprache - ich nenne sie GUI Design Language
(GDL) - vorstellen. Sie ist reichhaltig genug, um Oberfl&auml;chen nach in
Industrie und Verwaltung &uuml;blichen GUI-Styleguides zu beschreiben. Skripte
dieser Sprache, also GDL-Skripte, werden von meinem
<A HREF="../index.html" TARGET="_top">Java GuiBuilder</A> auf der Basis des
Java-GridBagLayouts interpretiert.
<P>
Mit dem hier realisierten kleinen
<A A HREF="../GApplet.html" TARGET="_self">Applet</A> k&ouml;nnen Sprache
und GuiBuilder getestet werden.Wer sich schrittweise mit beidem vertraut
machen will, der lese zur Einf&uuml;hrung der Reihe nach die Kapitel &uuml;ber
<A HREF="SyntaxGDL.html#Start" TARGET="_self">Umfang und Syntax der Designsprache
GDL</A>, <A HREF="Bedienung.html#Start" TARGET="_self">Bedienung des
GuiBuilders</A> und das
<A HREF="GridbagLayout.html#Start" TARGET="_self">Gridbag Layout</A>.
<P>
Als n&auml;chstes wird dann eine n&auml;here Besch&auml;ftigung mit
<A HREF="Komponenten.html#Start" TARGET="_self">Komponenten</A>,
<A HREF="Container.html#Start" TARGET="_self">Containern</A> und
<A HREF="AttributeUebersicht.html#Start" TARGET="_self">Attributen</A>
interessant. Im linken Frame gibt es - neben Links zu allen Kapiteln dieser
Bedienungsanleitung&nbsp;- einen &Uuml;berblick &uuml;ber den Umfang der
Sprache mit Links zum Vokabular der Sprache f&uuml;r jeden einzelnen
<A HREF="TableContent.html#Komponenten" TARGET="index">Komponenten</A>- und
<A HREF="TableContent.html#Container" TARGET="index">Container</A>-Typ.
<P>
<P>
  <HR>
<P ALIGN=Center>
Version 0.9.7 (5.7.2003)
<P ALIGN=Center>
<A HREF="../index.html" TARGET="_top">home</A>
</BODY></HTML>
